{
  "meta": {
    "title": "Meshhouse - бесплатные 3D модели для коммерческого использования"
  },
  "slider": {
    "slide-1": {
      "title": "Бесплатные 3D модели",
      "description": "Пригодные для коммерческого использования, с разумными ограничениями. Модели представлены в нескольких форматах."
    },
    "slide-2": {
      "title": "PBR-Ready материалы",
      "description": "На каждой модели наложены материалы, основанные на принципах PBR. Данные модели совместимы с современными игровыми движками, а также offline-рендерами (Vray, Arnold, Redshift, Renderman)."
    },
    "slide-3": {
      "title": "4K+ PBR-Ready текстуры",
      "description": "Используя современный pipeline, на выходе получаются PBR-Ready текстуры, имеющие разрешение в среднем 4K. При необходимости используем UDIM-развертку."
    }
  },
  "features": {
    "readytouse": {
      "title": "Готовые к использованию модели",
      "text": "Для того, чтобы использовать наши модели, не нужно прикладывать много усилий по очистке ненужных объектов из сцены. Просто скачайте модель в нужном формате, скачайте текстуры (если необходимо), и вставляйте в сцену.",
      "note": "Некоторые модели могут требовать адаптации под вашу модель, например, одежда."
    },
    "free": {
      "title": "Полностью бесплатно",
      "text": "Все модели, распространяющиеся на нашем сайте, полностью бесплатны. В том числе, для коммерческого использования (фильмы, игры и т.д)"
    },
    "opensource": {
      "title": "Открытый исходный код",
      "text": "Исходный код данного сайта, а также исходный код нашего приложения доступен в нашем GitHub репозитории, что позволяет убедиться в отсутствии следящих скриптов и прочих backdoor-ов."
    }
  },
  "programs": {
    "title": "Мы предоставляем модели в следующих форматах",
    "note": "Некоторые модели могут быть представлены только в одном из представленных форматов - это связано с тем, что модели выкладываются постепенно, а также необходимость конвертирования между форматами.",
    "max": "3ds Max 2016 и новее",
    "maya": "Maya 2016 и новее",
    "blender": "Blender 2.8 и новее",
    "cinema4d": "Cinema4D R20 и новее",
    "unity": "Unity 2019.3 и новее",
    "unreal": "Unreal Engine 4.20 и новее"
  }
}
