{
  "meta": {
    "title": "Meshhouse - free 3D models for commercial use"
  },
  "slider": {
    "slide-1": {
      "title": "Free 3D models",
      "description": "Also for commercial use, with fair restrictions. We provide models in several formats."
    },
    "slide-2": {
      "title": "PBR-Ready materials",
      "description": "Each model has materials, based on PBR principals. This models are compatible with models game engines and offline-renders (Vray, Arnold, Redshift, Renderman)."
    },
    "slide-3": {
      "title": "4K+ PBR-Ready textures",
      "description": "By using modern pipeline, we provide PBR-Ready textures, average at 4K resolution. In some cases we using UDIM-unwrapping."
    }
  },
  "features": {
    "readytouse": {
      "title": "Ready to use models",
      "text": "In order to use our models, you don't need to put in a lot of effort to clear unnecessary objects from the scene. Just download the model in the required format, download the textures (if necessary), and insert into the scene.",
      "note": "Some models should be adapted to your model, such as clothing."
    },
    "free": {
      "title": "Completely free",
      "text": "All models distributed on our website are completely free. Including for commercial use (films, games, etc.)"
    },
    "opensource": {
      "title": "Open source",
      "text": "We provide sources of this site and also sources of our application in our GitHub repository. This means that anyone can check for tracking scripts and other backdoors."
    }
  },
  "programs": {
    "title": "We provide models in next formats",
    "note": "Some models can be presented only in one of the presented formats - this is due to the fact that the models are laid out gradually, as well as the need to convert between formats.",
    "max": "3ds Max 2016 and newer",
    "maya": "Maya 2016 and newer",
    "blender": "Blender 2.8 and newer",
    "cinema4d": "Cinema4D R20 and newer",
    "unity": "Unity 2019.3 and newer",
    "unreal": "Unreal Engine 4.20 and newer"
  }
}
