<template>
  <div>
    <div class="grid-container">
      <header class="models-header">
        <h1 class="display-text display-text--h2">
          <span>
            {{ $t('pages.licensing.title') }}
          </span>
        </h1>
      </header>
    </div>
    <div class="grid-container grid-container--posts">
      <h1 class="display-text display-text--h3">
        <span>Основные ограничения</span>
      </h1>
      <p><b>Вы не можете:</b></p>
      <ul class="list">
        <li>Заявлять авторство на используемые модели</li>
        <li>Перезаливать файлы без разрешения автора</li>
        <li>Заливать измененные модели куда-либо без разрешения автора</li>
        <li>Продавать файлы по-одиночке либо пакетно</li>
      </ul>
      <p class="mb-3">
        Пояснения к пункту 3: изменять используемые модели можно (например, конвертирование в другой формат/рендерер/движок, исправление оригинальных багов и недочетов модели), но нельзя их заливать на всеобщее обозрение.
      </p>
      <h1 class="display-text display-text--h3">
        <span>Доступные лицензии</span>
      </h1>
      <h2 class="display-text display-text--h4">
        <span>Лицензия - Стандартная</span>
      </h2>
      <p class="mb-2">
        Данная лицензия используется на моделях, где не указан бренд, а также не указана метка "Контент для взрослых"
      </p>
      <h4 class="display-text display-text--h5">
        <span>Ограничения бесплатной лицензии</span>
      </h4>
      <ul class="list">
        <li>Рекомендуется указать авторство модели</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Критерии стандартной лицензии</span>
      </h4>
      <ul class="list">
        <li>Невозможность определения бренда (нет логотипа, либо вымышленный бренд)</li>
        <li>
          Модель нельзя отнести к контенту для взрослых. Примеры:
          <ul class="list">
            <li>Медицинские препараты, доступные в любом месте (презервативы, смазки, лекарства)</li>
            <li>Люди в одежде (хотя бы в нижнем белье либо купальнике)</li>
            <li>Предметы двойного назначения</li>
          </ul>
        </li>
      </ul>
      <h2 class="display-text display-text--h4">
        <span>Лицензия - Copyright</span>
      </h2>
      <p class="mb-2">
        Данная лицензия используется на моделях, где указан бренд (например, телефон популярной марки с нанесенным логотипом)
      </p>
      <h4 class="display-text display-text--h5">
        <span>Критерии лицензии Copyright</span>
      </h4>
      <ul class="list">
        <li>Однозначная идентификация бренда (логотип или другие отличительные черты)</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Ограничения бесплатной лицензии</span>
      </h4>
      <ul class="list">
        <li>Рекомендуется указать авторство модели</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Ограничения бесплатной и платной лицензии</span>
      </h4>
      <ul class="list">
        <li>Требуется разрешение правообладателя на использование модели</li>
      </ul>
      <h2 class="display-text display-text--h4">
        <span>Лицензия - Контент для взрослых</span>
      </h2>
      <p class="mb-2">
        Данная лицензия означает, что модель в большинстве случаев будут использовать в контенте для взрослых.
      </p>
      <h4 class="display-text display-text--h5">
        <span>Критерии контента для взрослых</span>
      </h4>
      <ul class="list">
        <li>Содержимое подходит под определение порнографии в законодательстве вашей страны</li>
        <li>Контент для взрослых сделан на этапе разработки (в случае игр это не сторонние модификации)</li>
        <li>Контент для взрослых распространяется на специализированных либо общих площадках, разрешающих такой контент (Patreon, OnlyFans, порносайты, Steam)</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Ограничения бесплатной лицензии</span>
      </h4>
      <ul class="list">
        <li>Обязательное указание авторства модели</li>
      </ul>
      <p class="mb-2">
        Этот пункт необходим для попытки сделать более честным использование подобных моделей (особенно в случае монетизации контента для взрослых).
      </p>
      <h2 class="display-text display-text--h4">
        <span>Указание авторства модели</span>
      </h2>
      <p class="mb-2">
        В данном пункте расписаны распространенные местоположения, куда можно поместить текст об использования моделей.
      </p>
      <h4 class="display-text display-text--h5">
        <span>Изображения (напр. Artstation, DeviantArt)</span>
      </h4>
      <ul class="list">
        <li>Описание изображения</li>
        <li>Мелкий шрифт поверх изображения (в случае отсутствия описания на площадке)</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Видеоигры</span>
      </h4>
      <ul class="list">
        <li>После всех авторов игры в титрах</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Фильмы, сериалы, видеоконтент</span>
      </h4>
      <ul class="list">
        <li>После всех авторов в титрах</li>
      </ul>
      <h4 class="display-text display-text--h5">
        <span>Контент для взрослых - видео</span>
      </h4>
      <ul class="list">
        <li>После всех авторов в титрах (если есть)</li>
        <li>В заставке мелким шрифтом (если есть)</li>
        <li>В описании под видео (если позволяет площадка)</li>
        <li>Добавить тег "meshhouse" или "#meshhouse" (если позволяет площадка)</li>
      </ul>
      <h2 class="display-text display-text--h4">
        <span>Платная лицензия</span>
      </h2>
      <p class="mb-2">
        Данная лицензия позволяет использовать модели без указания авторства модели (royalty-free). Для использования моделей под данной лицензией вам необходимо:
      </p>
      <ul class="list">
        <li>Быть подписанным на Patreon, Ko-fi или Boosty на минимальный tier, который дает доступ к royalty-free моделям</li>
        <li>Для моделей со стандартной лицензией, либо Copyright-лицензией вы должны быть подписаны на момент скачивания модели</li>
        <li>Для моделей с лицензией "Контент для взрослых" вы должны быть подписаны на всё время коммерческого использования модели</li>
      </ul>
      <p class="mb-3">
        Сертификаты модели будут доступны в личном кабинете. Данные сертификаты не являются юридическим документом.
      </p>
      <h2 class="display-text display-text--h4">
        <span>Коммерческое использование</span>
      </h2>
      <p>Под коммерческим использованием подразумевается получение дохода от производного либо авторского контента с использованием моделей с нашего сайта, в том числе платная подписка или paywall, либо пожертвования.</p>
    </div>
  </div>
</template>

<i18n>
{
  "en": {
    "pages": {
      "licensing": {
        "title": "Models licensing"
      }
    }
  },
  "ru": {
    "pages": {
      "licensing": {
        "title": "Лицензирование моделей"
      }
    }
  }
}
</i18n>

<script lang="ts">
import { Vue, Component } from 'nuxt-property-decorator'

@Component<LicensingPolicyPage>({
  head () {
    return {
      title: this.$t('pages.licensing.title').toString()
    }
  }
})

export default class LicensingPolicyPage extends Vue {}
</script>
